In [2]:
#EX1
import pandas as pd

dict  = {
    'Product': ['Apples', 'Oranges', 'Bananas'],
    'Price': [1.5, 1.2, 1.8],
    'InStock': [True, True,False]
}
df = pd.DataFrame(dict)
df

   Product  Price  InStock
0   Apples    1.5     True
1  Oranges    1.2     True
2  Bananas    1.8    False

In [ ]:
#EX2
list = [[1, 'Alice', 100_000], [2, 'Bob', 80_000], [3, 'CHarlie', 120_000]]
df2 = pd.DataFrame(
    list,
    columns=['ID', 'Name', 'Salary']
)
df2

   ID     Name  Salary
0   1    Alice  100000
1   2      Bob   80000
2   3  CHarlie  120000

In [9]:
#EX3
df.to_csv('products.csv', index = False)
df_from_csv = pd.read_csv('products.csv')
df_from_csv

   Product  Price  InStock
0   Apples    1.5     True
1  Oranges    1.2     True
2  Bananas    1.8    False

In [13]:
%pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\aynur\miniconda3\envs\ds\lib\site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in c:\users\aynur\miniconda3\envs\ds\lib\site-packages (from openpyxl) (2.0.0)
Note: you may need to restart the kernel to use updated packages.

In [15]:
#ex4

df2.to_excel('employees.xlsx',sheet_name ='Employees Data' ,index = False)
df_from_excel = pd.read_excel('employees.xlsx', sheet_name='Employees Data')
df_from_excel

   ID     Name  Salary
0   1    Alice  100000
1   2      Bob   80000
2   3  CHarlie  120000

In [31]:
#Ex5
data = {
    ('Q1', 'Sales'): {('USA', 'East'):100, ('USA','West'):120, ('EU', 'North'):80 },
    ('Q1', 'Profit'): {('USA', 'East'):20, ('USA', 'West'):25, ('EU', 'North'):15},
    ('Q2', 'Sales'): {('USA', 'East'):110, ('USA', 'West'):130, ('EU', 'North'):90},
    ('Q2', 'Profit'): {('USA', 'East'):22, ('USA', 'West'):28, ('EU', 'North'):18}
}
df3 = pd.DataFrame(data)
df3

             Q1           Q2
          Sales Profit Sales Profit
USA East    100     20   110     22
    West    120     25   130     28
EU  North    80     15    90     18

In [32]:
print(df3['Q1',  'Profit'])
print(df3['Q2', 'Profit'])

USA  East     20
     West     25
EU   North    15
Name: (Q1, Profit), dtype: int64
USA  East     22
     West     28
EU   North    18
Name: (Q2, Profit), dtype: int64

In [33]:
df3.loc['USA']

        Q1           Q2
     Sales Profit Sales Profit
East   100     20   110     22
West   120     25   130     28

In [39]:
#EX7
df3
stacked_df = df3.stack()
stacked_df

C:\Users\aynur\AppData\Local\Temp\ipykernel_15656\1551104078.py:3: FutureWarning: The previous implementation of stack is deprecated and will be removed in a future version of pandas. See the What's New notes for pandas 2.1.0 for details. Specify future_stack=True to adopt the new implementation and silence this warning.
  stacked_df = df3.stack()

                   Q1   Q2
USA East  Profit   20   22
          Sales   100  110
    West  Profit   25   28
          Sales   120  130
EU  North Profit   15   18
          Sales    80   90

In [40]:
df3

             Q1           Q2
          Sales Profit Sales Profit
USA East    100     20   110     22
    West    120     25   130     28
EU  North    80     15    90     18

In [41]:
#EX8 
df3.unstack(level= 0)

         Q1                        Q2
      Sales        Profit       Sales        Profit
         EU    USA     EU   USA    EU    USA     EU   USA
East    NaN  100.0    NaN  20.0   NaN  110.0    NaN  22.0
North  80.0    NaN   15.0   NaN  90.0    NaN   18.0   NaN
West    NaN  120.0    NaN  25.0   NaN  130.0    NaN  28.0

In [39]:
#EX9
data = {
    'Country':['Afghanistan', 'Albania', 'Algeria', 'Andorra', 'Angola'],
    'Code': ['AFG', 'ALB','DZA', 'AND', 'AGO'],
    'Continent':['Asia', 'Europe', 'Africa', 'Europe', 'Africa'],
    'Population':[41128771, 2842321, 44903225, 79034,35588987]
}
df_countries = pd.DataFrame(data)
df_countries

       Country Code Continent  Population
0  Afghanistan  AFG      Asia    41128771
1      Albania  ALB    Europe     2842321
2      Algeria  DZA    Africa    44903225
3      Andorra  AND    Europe       79034
4       Angola  AGO    Africa    35588987

In [10]:
df_countries.rename(columns = {'Country': 'ISO_Code'})

      ISO_Code Code Continent  Population
0  Afghanistan  AFG      Asia    41128771
1      Albania  ALB    Europe     2842321
2      Algeria  DZA    Africa    44903225
3      Andorra  AND    Europe       79034
4       Angola  AGO    Africa    35588987

In [11]:
new_df  = df_countries.set_index('Country')
new_df

            Code Continent  Population
Country
Afghanistan  AFG      Asia    41128771
Albania      ALB    Europe     2842321
Algeria      DZA    Africa    44903225
Andorra      AND    Europe       79034
Angola       AGO    Africa    35588987

In [12]:
#EX10
new_df.reset_index()

       Country Code Continent  Population
0  Afghanistan  AFG      Asia    41128771
1      Albania  ALB    Europe     2842321
2      Algeria  DZA    Africa    44903225
3      Andorra  AND    Europe       79034
4       Angola  AGO    Africa    35588987

In [40]:
df_countries = df_countries.set_index(['Continent', 'Country'])
df_countries = df_countries.sort_index()
df_countries

                      Code  Population
Continent Country
Africa    Algeria      DZA    44903225
          Angola       AGO    35588987
Asia      Afghanistan  AFG    41128771
Europe    Albania      ALB     2842321
          Andorra      AND       79034

In [42]:
df_countries.reset_index()
print(df_countries)

                      Code  Population
Continent Country
Africa    Algeria      DZA    44903225
          Angola       AGO    35588987
Asia      Afghanistan  AFG    41128771
Europe    Albania      ALB     2842321
          Andorra      AND       79034